Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_telemetry_bm_bg96/Secure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/eic.h
#define EIC_PINSTATE_PINSTATE_Pos             _UINT32_(0)                                          /* (EIC_PINSTATE Position) Pin State of EXTINTx5 */
#define EIC_PINSTATE_PINSTATE_Msk             (_UINT32_(0xFFFF) << EIC_PINSTATE_PINSTATE_Pos)      /* (EIC_PINSTATE Mask) PINSTATE */
#define EIC_PINSTATE_PINSTATE(value)          (EIC_PINSTATE_PINSTATE_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE_Pos)) 

/* -------- EIC_NSCHK : (EIC Offset: 0x3C) (R/W 32) Non-secure Interrupt Check Enable -------- */
#define EIC_NSCHK_RESETVALUE                  _UINT32_(0x00)                                       /*  (EIC_NSCHK) Non-secure Interrupt Check Enable  Reset Value */

#define EIC_NSCHK_EXTINT0_Pos                 _UINT32_(0)                                          /* (EIC_NSCHK) External Interrupt 0 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT0_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT0_Pos)             /* (EIC_NSCHK) External Interrupt 0 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT0(value)              (EIC_NSCHK_EXTINT0_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT0_Pos)) /* Assigment of value for EXTINT0 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT1_Pos                 _UINT32_(1)                                          /* (EIC_NSCHK) External Interrupt 1 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT1_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT1_Pos)             /* (EIC_NSCHK) External Interrupt 1 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT1(value)              (EIC_NSCHK_EXTINT1_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT1_Pos)) /* Assigment of value for EXTINT1 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT2_Pos                 _UINT32_(2)                                          /* (EIC_NSCHK) External Interrupt 2 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT2_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT2_Pos)             /* (EIC_NSCHK) External Interrupt 2 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT2(value)              (EIC_NSCHK_EXTINT2_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT3_Pos                 _UINT32_(3)                                          /* (EIC_NSCHK) External Interrupt 3 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT3_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT3_Pos)             /* (EIC_NSCHK) External Interrupt 3 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT3(value)              (EIC_NSCHK_EXTINT3_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT4_Pos                 _UINT32_(4)                                          /* (EIC_NSCHK) External Interrupt 4 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT4_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT4_Pos)             /* (EIC_NSCHK) External Interrupt 4 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT4(value)              (EIC_NSCHK_EXTINT4_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT4_Pos)) /* Assigment of value for EXTINT4 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT5_Pos                 _UINT32_(5)                                          /* (EIC_NSCHK) External Interrupt 5 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT5_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT5_Pos)             /* (EIC_NSCHK) External Interrupt 5 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT5(value)              (EIC_NSCHK_EXTINT5_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT5_Pos)) /* Assigment of value for EXTINT5 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT6_Pos                 _UINT32_(6)                                          /* (EIC_NSCHK) External Interrupt 6 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT6_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT6_Pos)             /* (EIC_NSCHK) External Interrupt 6 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT6(value)              (EIC_NSCHK_EXTINT6_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT6_Pos)) /* Assigment of value for EXTINT6 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT7_Pos                 _UINT32_(7)                                          /* (EIC_NSCHK) External Interrupt 7 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT7_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT7_Pos)             /* (EIC_NSCHK) External Interrupt 7 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT7(value)              (EIC_NSCHK_EXTINT7_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT7_Pos)) /* Assigment of value for EXTINT7 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT8_Pos                 _UINT32_(8)                                          /* (EIC_NSCHK) External Interrupt 8 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT8_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT8_Pos)             /* (EIC_NSCHK) External Interrupt 8 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT8(value)              (EIC_NSCHK_EXTINT8_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT8_Pos)) /* Assigment of value for EXTINT8 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT9_Pos                 _UINT32_(9)                                          /* (EIC_NSCHK) External Interrupt 9 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT9_Msk                 (_UINT32_(0x1) << EIC_NSCHK_EXTINT9_Pos)             /* (EIC_NSCHK) External Interrupt 9 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT9(value)              (EIC_NSCHK_EXTINT9_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT9_Pos)) /* Assigment of value for EXTINT9 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT10_Pos                _UINT32_(10)                                         /* (EIC_NSCHK) External Interrupt 10 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT10_Msk                (_UINT32_(0x1) << EIC_NSCHK_EXTINT10_Pos)            /* (EIC_NSCHK) External Interrupt 10 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT10(value)             (EIC_NSCHK_EXTINT10_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT10_Pos)) /* Assigment of value for EXTINT10 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT11_Pos                _UINT32_(11)                                         /* (EIC_NSCHK) External Interrupt 11 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT11_Msk                (_UINT32_(0x1) << EIC_NSCHK_EXTINT11_Pos)            /* (EIC_NSCHK) External Interrupt 11 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT11(value)             (EIC_NSCHK_EXTINT11_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT11_Pos)) /* Assigment of value for EXTINT11 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT12_Pos                _UINT32_(12)                                         /* (EIC_NSCHK) External Interrupt 12 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT12_Msk                (_UINT32_(0x1) << EIC_NSCHK_EXTINT12_Pos)            /* (EIC_NSCHK) External Interrupt 12 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT12(value)             (EIC_NSCHK_EXTINT12_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT12_Pos)) /* Assigment of value for EXTINT12 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT13_Pos                _UINT32_(13)                                         /* (EIC_NSCHK) External Interrupt 13 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT13_Msk                (_UINT32_(0x1) << EIC_NSCHK_EXTINT13_Pos)            /* (EIC_NSCHK) External Interrupt 13 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT13(value)             (EIC_NSCHK_EXTINT13_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT13_Pos)) /* Assigment of value for EXTINT13 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT14_Pos                _UINT32_(14)                                         /* (EIC_NSCHK) External Interrupt 14 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT14_Msk                (_UINT32_(0x1) << EIC_NSCHK_EXTINT14_Pos)            /* (EIC_NSCHK) External Interrupt 14 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT14(value)             (EIC_NSCHK_EXTINT14_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT14_Pos)) /* Assigment of value for EXTINT14 in the EIC_NSCHK register */
#define EIC_NSCHK_EXTINT15_Pos                _UINT32_(15)                                         /* (EIC_NSCHK) External Interrupt 15 Nonsecure Check Enable Position */
#define EIC_NSCHK_EXTINT15_Msk                (_UINT32_(0x1) << EIC_NSCHK_EXTINT15_Pos)            /* (EIC_NSCHK) External Interrupt 15 Nonsecure Check Enable Mask */
#define EIC_NSCHK_EXTINT15(value)             (EIC_NSCHK_EXTINT15_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT15_Pos)) /* Assigment of value for EXTINT15 in the EIC_NSCHK register */
#define EIC_NSCHK_NMI_Pos                     _UINT32_(31)                                         /* (EIC_NSCHK) Non-Maskable External Interrupt Nonsecure Check Enable Position */
#define EIC_NSCHK_NMI_Msk                     (_UINT32_(0x1) << EIC_NSCHK_NMI_Pos)                 /* (EIC_NSCHK) Non-Maskable External Interrupt Nonsecure Check Enable Mask */
#define EIC_NSCHK_NMI(value)                  (EIC_NSCHK_NMI_Msk & (_UINT32_(value) << EIC_NSCHK_NMI_Pos)) /* Assigment of value for NMI in the EIC_NSCHK register */
#define EIC_NSCHK_Msk                         _UINT32_(0x8000FFFF)                                 /* (EIC_NSCHK) Register Mask  */

#define EIC_NSCHK_EXTINT_Pos                  _UINT32_(0)                                          /* (EIC_NSCHK Position) External Interrupt x Nonsecure Check Enable */
#define EIC_NSCHK_EXTINT_Msk                  (_UINT32_(0xFFFF) << EIC_NSCHK_EXTINT_Pos)           /* (EIC_NSCHK Mask) EXTINT */
#define EIC_NSCHK_EXTINT(value)               (EIC_NSCHK_EXTINT_Msk & (_UINT32_(value) << EIC_NSCHK_EXTINT_Pos)) 

/* -------- EIC_NONSEC : (EIC Offset: 0x40) (R/W 32) Non-secure Interrupt -------- */
#define EIC_NONSEC_RESETVALUE                 _UINT32_(0x00)                                       /*  (EIC_NONSEC) Non-secure Interrupt  Reset Value */

#define EIC_NONSEC_EXTINT0_Pos                _UINT32_(0)                                          /* (EIC_NONSEC) External Interrupt 0 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT0_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT0_Pos)            /* (EIC_NONSEC) External Interrupt 0 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT0(value)             (EIC_NONSEC_EXTINT0_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT0_Pos)) /* Assigment of value for EXTINT0 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT1_Pos                _UINT32_(1)                                          /* (EIC_NONSEC) External Interrupt 1 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT1_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT1_Pos)            /* (EIC_NONSEC) External Interrupt 1 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT1(value)             (EIC_NONSEC_EXTINT1_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT1_Pos)) /* Assigment of value for EXTINT1 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT2_Pos                _UINT32_(2)                                          /* (EIC_NONSEC) External Interrupt 2 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT2_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT2_Pos)            /* (EIC_NONSEC) External Interrupt 2 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT2(value)             (EIC_NONSEC_EXTINT2_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT3_Pos                _UINT32_(3)                                          /* (EIC_NONSEC) External Interrupt 3 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT3_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT3_Pos)            /* (EIC_NONSEC) External Interrupt 3 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT3(value)             (EIC_NONSEC_EXTINT3_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT4_Pos                _UINT32_(4)                                          /* (EIC_NONSEC) External Interrupt 4 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT4_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT4_Pos)            /* (EIC_NONSEC) External Interrupt 4 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT4(value)             (EIC_NONSEC_EXTINT4_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT4_Pos)) /* Assigment of value for EXTINT4 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT5_Pos                _UINT32_(5)                                          /* (EIC_NONSEC) External Interrupt 5 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT5_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT5_Pos)            /* (EIC_NONSEC) External Interrupt 5 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT5(value)             (EIC_NONSEC_EXTINT5_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT5_Pos)) /* Assigment of value for EXTINT5 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT6_Pos                _UINT32_(6)                                          /* (EIC_NONSEC) External Interrupt 6 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT6_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT6_Pos)            /* (EIC_NONSEC) External Interrupt 6 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT6(value)             (EIC_NONSEC_EXTINT6_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT6_Pos)) /* Assigment of value for EXTINT6 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT7_Pos                _UINT32_(7)                                          /* (EIC_NONSEC) External Interrupt 7 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT7_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT7_Pos)            /* (EIC_NONSEC) External Interrupt 7 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT7(value)             (EIC_NONSEC_EXTINT7_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT7_Pos)) /* Assigment of value for EXTINT7 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT8_Pos                _UINT32_(8)                                          /* (EIC_NONSEC) External Interrupt 8 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT8_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT8_Pos)            /* (EIC_NONSEC) External Interrupt 8 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT8(value)             (EIC_NONSEC_EXTINT8_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT8_Pos)) /* Assigment of value for EXTINT8 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT9_Pos                _UINT32_(9)                                          /* (EIC_NONSEC) External Interrupt 9 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT9_Msk                (_UINT32_(0x1) << EIC_NONSEC_EXTINT9_Pos)            /* (EIC_NONSEC) External Interrupt 9 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT9(value)             (EIC_NONSEC_EXTINT9_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT9_Pos)) /* Assigment of value for EXTINT9 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT10_Pos               _UINT32_(10)                                         /* (EIC_NONSEC) External Interrupt 10 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT10_Msk               (_UINT32_(0x1) << EIC_NONSEC_EXTINT10_Pos)           /* (EIC_NONSEC) External Interrupt 10 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT10(value)            (EIC_NONSEC_EXTINT10_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT10_Pos)) /* Assigment of value for EXTINT10 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT11_Pos               _UINT32_(11)                                         /* (EIC_NONSEC) External Interrupt 11 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT11_Msk               (_UINT32_(0x1) << EIC_NONSEC_EXTINT11_Pos)           /* (EIC_NONSEC) External Interrupt 11 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT11(value)            (EIC_NONSEC_EXTINT11_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT11_Pos)) /* Assigment of value for EXTINT11 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT12_Pos               _UINT32_(12)                                         /* (EIC_NONSEC) External Interrupt 12 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT12_Msk               (_UINT32_(0x1) << EIC_NONSEC_EXTINT12_Pos)           /* (EIC_NONSEC) External Interrupt 12 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT12(value)            (EIC_NONSEC_EXTINT12_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT12_Pos)) /* Assigment of value for EXTINT12 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT13_Pos               _UINT32_(13)                                         /* (EIC_NONSEC) External Interrupt 13 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT13_Msk               (_UINT32_(0x1) << EIC_NONSEC_EXTINT13_Pos)           /* (EIC_NONSEC) External Interrupt 13 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT13(value)            (EIC_NONSEC_EXTINT13_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT13_Pos)) /* Assigment of value for EXTINT13 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT14_Pos               _UINT32_(14)                                         /* (EIC_NONSEC) External Interrupt 14 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT14_Msk               (_UINT32_(0x1) << EIC_NONSEC_EXTINT14_Pos)           /* (EIC_NONSEC) External Interrupt 14 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT14(value)            (EIC_NONSEC_EXTINT14_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT14_Pos)) /* Assigment of value for EXTINT14 in the EIC_NONSEC register */
#define EIC_NONSEC_EXTINT15_Pos               _UINT32_(15)                                         /* (EIC_NONSEC) External Interrupt 15 Nonsecure Enable Position */
#define EIC_NONSEC_EXTINT15_Msk               (_UINT32_(0x1) << EIC_NONSEC_EXTINT15_Pos)           /* (EIC_NONSEC) External Interrupt 15 Nonsecure Enable Mask */
#define EIC_NONSEC_EXTINT15(value)            (EIC_NONSEC_EXTINT15_Msk & (_UINT32_(value) << EIC_NONSEC_EXTINT15_Pos)) /* Assigment of value for EXTINT15 in the EIC_NONSEC register */
#define EIC_NONSEC_NMI_Pos                    _UINT32_(31)                                         /* (EIC_NONSEC) Non-Maskable Interrupt Nonsecure Enable Position */
#define EIC_NONSEC_NMI_Msk                    (_UINT32_(0x1) << EIC_NONSEC_NMI_Pos)                /* (EIC_NONSEC) Non-Maskable Interrupt Nonsecure Enable Mask */
#define EIC_NONSEC_NMI(value)                 (EIC_NONSEC_NMI_Msk & (_UINT32_(value) << EIC_NONSEC_NMI_Pos)) /* Assigment of value for NMI in the EIC_NONSEC register */
#define EIC_NONSEC_Msk                        _UINT32_(0x8000FFFF)                                 /* (EIC_NONSEC) Register Mask  */

